Revit 2027 API
BuiltInFailures.FamilyFailures.FormulasFailedForType Property
 "Can't satisfy formulas for type [Family Symbol].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormulasFailedForType { get; }
Public Shared ReadOnly Property FormulasFailedForType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormulasFailedForType {
	FailureDefinitionId^ get ();
}
static member FormulasFailedForType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace